import random
print("เลือกเลขมา 6 ตัวที่ไม่ซ้ำ ให้กรอกที่ละตัวแล้วกด Enter")
b = []
for i in range(7): # วนเก็บข้อมูล 7 ครั้งเก็บไว้ในตัวแปร b
    print(f"เลขตัวที่ {i+1} : ")
    while True:
        a = input()
        if len(a) > 1 or a.isdigit() != True or a in b : # ตรวจสอบให้กรอกทีละตัว,เป็นตัวเลข และไม่ซ้ำตัวที่เคยกรอกมาแล้ว
            print("ไม่ถูกต้องพิมพ์ใหม่")
            continue
        else:
            b.append(a) # ตรงตามเงื่อนไขก็เพิ่มข้อมูลเก็บไว้ในตัวแปร b
            break
print(b)
'''print("ได้เลข 3 ตัวโต๊ดดังต่อไปนี้")

t1,t2,t3,t4,t5,t6,t7,t8,t9,t10 = b[0]+b[1]+b[2],b[0]+b[1]+b[3],b[0]+b[1]+b[4],b[0]+b[1]+b[5],b[0]+b[2]+b[3],b[0]+b[2]+b[4],b[0]+b[2]+b[5],b[0]+b[3]+b[4],b[0]+b[3]+b[5],b[0]+b[4]+b[5]
print(t1,t2,t3,t4,t5,t6,t7,t8,t9,t10)
r1,r2,r3,r4,r5,r6 = b[1]+b[2]+b[3],b[1]+b[2]+b[4],b[1]+b[2]+b[5],b[1]+b[3]+b[4],b[1]+b[3]+b[5],b[1]+b[4]+b[5]
print(r1,r2,r3,r4,r5,r6)
y1,y2,y3 = b[2]+b[3]+b[4],b[2]+b[3]+b[5],b[2]+b[4]+b[5]
print(y1,y2,y3)
m1 = b[3]+b[4]+b[5]
print(m1)'''

print("ได้เลข 3 ตัวโต๊ดดังต่อไปนี้")
c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15 = b[0]+b[1]+b[2],b[0]+b[1]+b[3],b[0]+b[1]+b[4],b[0]+b[1]+b[5],b[0]+b[1]+b[6],b[0]+b[2]+b[3],b[0]+b[2]+b[4],b[0]+b[2]+b[5],b[0]+b[2]+b[6],b[0]+b[3]+b[4],b[0]+b[3]+b[5],b[0]+b[3]+b[6],b[0]+b[4]+b[5],b[0]+b[4]+b[6],b[0]+b[5]+b[6]
d1,d2,d3,d4,d5,d6,d7,d8,d9,d10 = b[1]+b[2]+b[3],b[1]+b[2]+b[4],b[1]+b[2]+b[5],b[1]+b[2]+b[6],b[1]+b[3]+b[4],b[1]+b[3]+b[5],b[1]+b[3]+b[6],b[1]+b[4]+b[5],b[1]+b[4]+b[6],b[1]+b[5]+b[6]
f1,f2,f3,f4,f5,f6 = b[2]+b[3]+b[4],b[2]+b[3]+b[5],b[2]+b[3]+b[6],b[2]+b[4]+b[5],b[2]+b[4]+b[6],b[2]+b[5]+b[6]
g1,g2,g3 = b[3]+b[4]+b[5],b[3]+b[4]+b[6],b[3]+b[5]+b[6]
h1 = b[4]+b[5]+b[6]
lot = [c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,d1,d2,d3,d4,d5,d6,d7,d8,d9,d10,f1,f2,f3,f4,f5,f6,g1,g2,g3,h1]
print(random.sample(lot,k=30))

 
